Revit 2027 API
ElectricalSetting.WireConduitTypes Property
 Get electrical conduit types information of the project.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WireConduitTypeSet WireConduitTypes { get; }
Public ReadOnly Property WireConduitTypes As WireConduitTypeSet
	Get
public:
property WireConduitTypeSet^ WireConduitTypes {
	WireConduitTypeSet^ get ();
}
member WireConduitTypes : WireConduitTypeSet with get
Property Value
WireConduitTypeSet
See Also
Reference
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace